{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.1.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 10, 2048], "dtype": "float32", "sparse": false, "ragged": false, "name": "flatten_input"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "batch_input_shape": [null, 10, 10, 2048], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 408, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 204, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 102, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 13, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["acc"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of80.bin", "group1-shard2of80.bin", "group1-shard3of80.bin", "group1-shard4of80.bin", "group1-shard5of80.bin", "group1-shard6of80.bin", "group1-shard7of80.bin", "group1-shard8of80.bin", "group1-shard9of80.bin", "group1-shard10of80.bin", "group1-shard11of80.bin", "group1-shard12of80.bin", "group1-shard13of80.bin", "group1-shard14of80.bin", "group1-shard15of80.bin", "group1-shard16of80.bin", "group1-shard17of80.bin", "group1-shard18of80.bin", "group1-shard19of80.bin", "group1-shard20of80.bin", "group1-shard21of80.bin", "group1-shard22of80.bin", "group1-shard23of80.bin", "group1-shard24of80.bin", "group1-shard25of80.bin", "group1-shard26of80.bin", "group1-shard27of80.bin", "group1-shard28of80.bin", "group1-shard29of80.bin", "group1-shard30of80.bin", "group1-shard31of80.bin", "group1-shard32of80.bin", "group1-shard33of80.bin", "group1-shard34of80.bin", "group1-shard35of80.bin", "group1-shard36of80.bin", "group1-shard37of80.bin", "group1-shard38of80.bin", "group1-shard39of80.bin", "group1-shard40of80.bin", "group1-shard41of80.bin", "group1-shard42of80.bin", "group1-shard43of80.bin", "group1-shard44of80.bin", "group1-shard45of80.bin", "group1-shard46of80.bin", "group1-shard47of80.bin", "group1-shard48of80.bin", "group1-shard49of80.bin", "group1-shard50of80.bin", "group1-shard51of80.bin", "group1-shard52of80.bin", "group1-shard53of80.bin", "group1-shard54of80.bin", "group1-shard55of80.bin", "group1-shard56of80.bin", "group1-shard57of80.bin", "group1-shard58of80.bin", "group1-shard59of80.bin", "group1-shard60of80.bin", "group1-shard61of80.bin", "group1-shard62of80.bin", "group1-shard63of80.bin", "group1-shard64of80.bin", "group1-shard65of80.bin", "group1-shard66of80.bin", "group1-shard67of80.bin", "group1-shard68of80.bin", "group1-shard69of80.bin", "group1-shard70of80.bin", "group1-shard71of80.bin", "group1-shard72of80.bin", "group1-shard73of80.bin", "group1-shard74of80.bin", "group1-shard75of80.bin", "group1-shard76of80.bin", "group1-shard77of80.bin", "group1-shard78of80.bin", "group1-shard79of80.bin", "group1-shard80of80.bin"], "weights": [{"name": "dense/kernel", "shape": [204800, 408], "dtype": "float32"}, {"name": "dense/bias", "shape": [408], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [408, 204], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [204], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [204, 102], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [102], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [102, 13], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [13], "dtype": "float32"}]}]}