{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.1.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 10, 2048], "dtype": "float32", "sparse": false, "ragged": false, "name": "flatten_5_input"}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "batch_input_shape": [null, 10, 10, 2048], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 260, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 130, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 13, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["acc"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of51.bin", "group1-shard2of51.bin", "group1-shard3of51.bin", "group1-shard4of51.bin", "group1-shard5of51.bin", "group1-shard6of51.bin", "group1-shard7of51.bin", "group1-shard8of51.bin", "group1-shard9of51.bin", "group1-shard10of51.bin", "group1-shard11of51.bin", "group1-shard12of51.bin", "group1-shard13of51.bin", "group1-shard14of51.bin", "group1-shard15of51.bin", "group1-shard16of51.bin", "group1-shard17of51.bin", "group1-shard18of51.bin", "group1-shard19of51.bin", "group1-shard20of51.bin", "group1-shard21of51.bin", "group1-shard22of51.bin", "group1-shard23of51.bin", "group1-shard24of51.bin", "group1-shard25of51.bin", "group1-shard26of51.bin", "group1-shard27of51.bin", "group1-shard28of51.bin", "group1-shard29of51.bin", "group1-shard30of51.bin", "group1-shard31of51.bin", "group1-shard32of51.bin", "group1-shard33of51.bin", "group1-shard34of51.bin", "group1-shard35of51.bin", "group1-shard36of51.bin", "group1-shard37of51.bin", "group1-shard38of51.bin", "group1-shard39of51.bin", "group1-shard40of51.bin", "group1-shard41of51.bin", "group1-shard42of51.bin", "group1-shard43of51.bin", "group1-shard44of51.bin", "group1-shard45of51.bin", "group1-shard46of51.bin", "group1-shard47of51.bin", "group1-shard48of51.bin", "group1-shard49of51.bin", "group1-shard50of51.bin", "group1-shard51of51.bin"], "weights": [{"name": "dense_19/kernel", "shape": [204800, 260], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [260], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [260, 130], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [130], "dtype": "float32"}, {"name": "dense_21/kernel", "shape": [130, 13], "dtype": "float32"}, {"name": "dense_21/bias", "shape": [13], "dtype": "float32"}]}]}